import { Component, OnInit } from '@angular/core';
import { ScrollTopService } from 'src/app/services/scroll-top.service';

@Component({
  selector: 'app-service-prices',
  templateUrl: './service-prices.component.html',
  styleUrls: ['./service-prices.component.css']
})
export class ServicePricesComponent implements OnInit{

  constructor(private scrolltopService: ScrollTopService) {}

  ngOnInit(): void {
    this.scrolltopService.scrollTop();
  }

  example = [
    {
      title: 'ელქტრონული და სხვა კომერციის ვებსაიტები',
      image: 'assets/e-commerce.gif',
      description1: '$1,625 -დან $6,500-მდე: ძირითადი ონლაინ მაღაზია პროდუქტების ჩამონათვალით, საყიდლების კალათით და გადახდის დამუშავებით.',
      description2: '$6,500 -დან $16,250 -მდე: უფრო მოწინავე მაღაზია მრავალი პროდუქტის კატეგორიით, ანგარიშის მენეჯმენტით, მარკეტინგის ფუნქციებით და ინტეგრაციით მესამე მხარის სერვისებთან.',
      description3: '$16,250 +: უაღრესად მორგებული და მასშტაბური მაღაზია პროდუქტის რთული ვარიაციით, ინვენტარის მენეჯმენტით, პერსონალიზებული რეკომენდაციებით და მობილური აპლიკაციების ინტეგრაციით.',
      collapse: "collapseOne"
    }
  ];

  accordion = [
    {
      title: 'პორტფოლიოს ვებსაიტები',
      image: 'assets/portfolio.gif',
      description1: '163 დოლარი: მარტივი პორტფოლიო ვებსაიტი ძირითადი დიზაინითა და ფუნქციონირებით, ხშირად აშენებული შაბლონების გამოყენებით.',
      description2: '$163 -დან $1,625-მდე: უფრო მორგებული პორტფელის ვებსაიტი ინტერაქტიული ელემენტებით, მაღალი ხარისხის ვიზუალით და სოციალური მედიის პლატფორმებთან ინტეგრირებით.',
      description3: '$2,500-დან $5,000+: უაღრესად მორგებული პორტფელის ვებსაიტი უნიკალური ფუნქციებით, ინტერაქტიული ელემენტებით და დიდი პორტფოლიოების გამოფენით.',
      collapse: 'collapseThree'
    },
    {
      title: 'არაკომერციული საიტები | Non Profit',
      image: 'assets/non-profit.gif',
      description1: '650 დოლარი: მარტივი ვებსაიტი ძირითადი ინფორმაციით ორგანიზაციის, მისიის განცხადების და შემოწირულობის ვარიანტების შესახებ.',
      description2: '$650 - დან $3,250 - მდე: უფრო ინტერაქტიული ვებსაიტი მოხალისეების შესაძლებლობებით, რეგისტრაციისა და ღონისძიებების ჩამონათვალით.',
      description3: '$3,250 +: უაღრესად მორგებული ვებსაიტი თანხების მოზიდვის მოწინავე ფუნქციებით, დონორთა მართვის ხელსაწყოებით და ინტერაქტიული შინაარსით.',
      collapse: 'collapseFour'
    },
    {
      title: 'სოციალური მედიის ვებსაიტები',
      image: 'assets/social-media.gif',
      description1: '$15,500 -დან $31,000 +: მარტივი სოციალური მედიის პლატფორმა მომხმარებლის ძირითადი პროფილებით, შეტყობინებების და შინაარსის გაზიარების ფუნქციებით.',
      description2: '$31,000 - დან $90,000+: უფრო რთული პლატფორმა მომხმარებლის მოწინავე მენეჯმენტით(ანუ პროფილის ფეიჯს, რო განკარგავ ისე, როგორც გინდა), ჯგუფური მახასიათებლებით(Facebook-ის ჯგუფები და გვერდები მაგალითად), ვერიფიკაციის ელემენტებით და მონეტიზაციის ჩაშენებული სისტემით.',
      description3: '$99,000+: ძალიან მასშტაბირებადი პლატფორმა დახვეწილი ალგორითმებით, რეალურ დროში განახლებებით და სხვა პლატფორმებთან ინტეგრირებით.',
      collapse: 'collapseTwo'
    }
  ]
}
